app/views/messages/index.html.erb

SELECT  "messages".* FROM "messages" ORDER BY "messages"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  <% if t.user != @current_user %>
    <% if t.messages.first.present? && t.messages.first.sender == @current_user %>