app/views/things/show.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."thing_id" = $1  [["thing_id", 130]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
---
  <h4>Messages:</h4>
  <% @thing.messages.each do |m| %>
  <h3>from <%= User.find(m.user_id).name %></h3>