app/views/users/_show.html.erb

SELECT "things".* FROM "things" WHERE "things"."user_id" = $1  [["user_id", 82]]
SELECT COUNT(*) FROM "things" WHERE "things"."user_id" = $1  [["user_id", 82]]
SELECT COUNT(*) FROM "things" WHERE "things"."user_id" = $1 AND "things"."act" = $2  [["user_id", 82], ["act", 0]]
SELECT COUNT(*) FROM "things" WHERE "things"."user_id" = $1 AND "things"."act" = $2  [["user_id", 82], ["act", 1]]
SELECT COUNT(*) FROM "messages" WHERE "messages"."user_id" = $1  [["user_id", 82]]
---
<p>
  You have <%= @user.things.count %> listings <br>
  <%= @user.things.where(act:'need').count %> - Needs <br>
  <%= @user.things.where(act:'offer').count %> - Offers <br>
  <br>
  You have <%= @current_user.messages.count %> messages.
</p>

SELECT "things".* FROM "things" WHERE "things"."user_id" = $1  [["user_id", 82]]
---
  <ul>
    <% @user.things.each do |t| %>

SELECT COUNT(*) FROM "messages" WHERE "messages"."thing_id" = $1  [["thing_id", 130]]
---
      <li>
        <%= link_to "#{t.act} - #{t.name}: #{t.messages.count}msgs", thing_path(t.id) %>