app/views/users/show.html.erb

SELECT COUNT(*) FROM "things" WHERE "things"."user_id" = $1  [["user_id", 47]]
SELECT "things".* FROM "things" WHERE "things"."user_id" = $1  [["user_id", 36]]
SELECT COUNT(*) FROM "things" WHERE "things"."user_id" = $1 AND "things"."act" = $2  [["user_id", 47], ["act", "offer"]]
---
<ul>
  <li>You have <%= @user.things.count %> listings </li>
  <li><%= @user.things.where(act:'need').count %> - Needs </li>