app/controllers/messages_controller.rb

INSERT INTO "messages" ("subject", "message", "to_id", "created_at", "updated_at", "thing_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["subject", "hello"], ["message", "cani have?"], ["to_id", 82], ["created_at", "2020-01-13 20:33:01.520289"], ["updated_at", "2020-01-13 20:33:01.520289"], ["thing_id", 130]]
INSERT INTO "messages" ("message", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message", "{\"to_id\"=>\"\", \"message\"=>\"123123123123\"}"], ["user_id", 47], ["created_at", "2020-01-12 11:45:17.095139"], ["updated_at", "2020-01-12 11:45:17.095139"]]
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 135], ["LIMIT", 1]]
---
  def create
    message = Message.create message_params
    @current_user.messages << message
    @thing = Thing.find params[:message][:thing_id]

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 95], ["LIMIT", 1]]
---
  def show
    @message = Message.find params[:id]

SELECT  "messages".* FROM "messages" ORDER BY "messages"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @messages = Message.all