app/controllers/things_controller.rb

  def create
    thing = @current_user.things.create thing_params
---
INSERT INTO "things" ("name", "act", "quantity", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "clear gutters"], ["act", "need"], ["quantity", 1], ["image", ""], ["created_at", "2020-01-12 19:46:25.048950"], ["updated_at", "2020-01-12 19:46:25.048950"]]

  def index
    @things = Thing.all
---
SELECT "things".* FROM "things"

  def show
    @thing = Thing.find params[:id]
---
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]

  def edit
    @thing = Thing.find params[:id]
---
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]

  def update
    puts params
    @thing = Thing.find params[:id]
    # redirect_to login_path and return unless @thing.user == @current_user
    @thing.update thing_params
---
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 57], ["LIMIT", 1]]
UPDATE "things" SET "act" = $1, "image" = $2, "updated_at" = $3 WHERE "things"."id" = $4  [["act", "offer"], ["image", ""], ["updated_at", "2020-01-12 23:16:56.658442"], ["id", 57]]

  def destroy
    Thing.destroy params[:id]
---
DELETE FROM "things" WHERE "things"."id" = $1  [["id", 47]]