app/controllers/things_controller.rb

  def update
    @thing = Thing.find params[:id]
---
SELECT  "things".* FROM "things" WHERE "things"."id" = $1 LIMIT $2  [["id", 129], ["LIMIT", 1]]

  def destroy
    Thing.destroy params[:id]
---
DELETE FROM "things" WHERE "things"."id" = $1  [["id", 129]]