app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    # raise 'hell'
    @user = User.new user_params
    if params[:file].present?
      req = Cloudinary::Uploader.upload(params[:file])
      @user.image = req["public_id"]
    end
    @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
---
  def show
    check_if_logged_in
    @user = User.find params[:id]

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "tim@test.com"], ["password_digest", "$2a$12$eOfgIjobD6290hTuk9EBLuYyssn0b5hr8962pn6tnFtT.Dn2ABZv."], ["updated_at", "2020-01-12 09:41:06.070378"], ["id", 36]]
---
  def update
    @user = User.find params[:id]
    @user.update user_params

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 43]]
---
  def destroy
    User.destroy params[:id]